# Introduction to Pandas

In [2]:
import pandas as pd
pd.__version__

'1.5.0'

# Pandas Series
## Characteristics of a Pandas Series
- Use the .values attribute to output the values
- Use the .index attribute to output the index
- Series can be indexed using [] notation
- Series can also indexed with slicing notation `data[1:3]` 1 is inclusive, 3 is exclusive

In [3]:


data = pd.Series([0.25, 0.5, 0.75, 1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data[1:3]

1    0.50
2    0.75
dtype: float64

# DataFrames
- syntax `pd.DataFrame({col1:val1, col2:val2, col3:val3})`

In [5]:


df = pd.DataFrame({
    'name': ['Bob', 'Jen', 'Tim'],
    'age': [20, 30, 40],
    'pet': ['cat', 'dog', 'bird'],
})
df

  name  age   pet
0  Bob   20   cat
1  Jen   30   dog
2  Tim   40  bird

# Indexers (loc and iloc)

In [7]:
# loc
# purposely specifying the index
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [8]:
# explicit index when indexing (specifying a direct value of the index)
data[1]

'a'

In [9]:
# implicit index when slicing
# it is going off of positioning
# so in position 1 there is b, in position 2 there is c
data[1:3]

/var/folders/wg/8yz1tny10yl9ct8bq7zl3pp00000gn/T/ipykernel_48798/278637746.py:4: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  data[1:3]

3    b
5    c
dtype: object

In [10]:
# loc is explicit, iloc is implicit
data.loc[1]

# Here we are explicitly specifying the index value

'a'

In [11]:
data.iloc[1]

# Here we are specifying the index position

'b'

In [12]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [13]:
# using the df created above, more complex examples

In [14]:
# Permanently sorting by pet
df.sort_values('pet', inplace=True)
df

  name  age   pet
2  Tim   40  bird
0  Bob   20   cat
1  Jen   30   dog

In [15]:
# How to obtain Bob?

df.loc[0]

name    Bob
age      20
pet     cat
Name: 0, dtype: object

In [16]:
# If we did iloc?

df.iloc[0]

name     Tim
age       40
pet     bird
Name: 2, dtype: object

In [17]:
# Selecting a column

df.iloc[:, 2]

2    bird
0     cat
1     dog
Name: pet, dtype: object

In [18]:
# To get last row

df.iloc[-1, :]

name    Jen
age      30
pet     dog
Name: 1, dtype: object

In [19]:
# Slicing dataframes

In [20]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area': area, 'pop': pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [21]:
# Just get areas for each state

data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [22]:
# Another way
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [23]:
# Get a normalized number like population density
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [24]:
# Multidimensional dataframes

data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [25]:
# Transposing

data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [26]:
# Grabbing values using loc and iloc

# Get first two columns and first 3 rows

data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [27]:
# Another way

data.loc[:'New York', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [28]:
# Masking in Pandas DFs: Using math operators to create logic. When the logic condition is met, display those rows
# Interested in states where density > 100. Only output pop and density columns

data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [29]:
# Writing values

data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [30]:
# additional ways to index

data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [31]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [32]:
# Masking again

data[data['density'] > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121